package lesson_6;
/*
1. Напишите метод, который заполнит массив из 1000 элементов случайными числами от 0 до 24.
1.5. Создайте метод, в который передайте заполненный выше массив,
 и с помощью Set вычислите процент уникальных значений в данном массиве,
  и верните его в виде числа с плавающей запятой.
Для вычисления процента используйте формулу:
процент уникальных чисел = количество уникальных чисел * 100 / общее количество чисел в массиве.
 */
public class Task01 {
    public static void main(String[] args) {

    }

}
